<?php

// 1. 반복문을 이용해서 아래와 같이 출력해 주세요.

// 갯수는 내가 입력한 갯수만큼

// *
// **
// ***
// ****
// *****


// $num = 10;
// for ($i=0; $i <= $num; $i++)
//     { 
//         for ($p = 0; $p <=$i; $p++)
//         {
//             echo "*";
//         }
//         echo "\n";
        
//     }

// $num = 10;    
// for ($i = 0; $i <= $num; $i++)
//     {
//         for ($p = $num; $p >= $i; $p--)
//         {
//         echo "*";
//         }
//         echo "\n";
//     }




// $num = 10;
// for($i = 0; $i <= $num; $i++)
// {
//     for($p = 0; $p <= $i; $p++)
//     {
//         echo "*";
//     }
//     echo "\n";
// }


// $num = 10;
// for($i = $num; $i > 0; $i--)
// {
//     for($p = 0; $p < $i; $p++)
//     {
//         echo "*";
//     }
//     echo "\n";
// }


for($i=1; $i < 6; $i++)
{
    for($p=5; $i < $p; $p--)
    {
        echo " ";
    }
    for($p=0; $i > $p; $p++)
    {
        echo "*";
    }
    echo"\n";
}



// $num = 10;
// for ($i = 1; $i < $num; $i++)
// {
//     for ($k = $num-$i; $k > 0 ; $k--)
//     {
//         echo " ";
//     }
//     for ($p = 0; $p < 2*$i-1; $p++)
//         {
//             echo "*";
//         }
//         echo "\n";
// }




?>